In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [2]:
# Project folder path
path = r'C:\Users\nanu_\Documents\Career Foundry\Projects\2 Data Immersion\Python fundamental for Data Analysis\01-2024 Instacart Basket analysis'

In [3]:
path

'C:\\Users\\nanu_\\Documents\\Career Foundry\\Projects\\2 Data Immersion\\Python fundamental for Data Analysis\\01-2024 Instacart Basket analysis'

In [4]:
# Importing orders_products_prior Dataframe
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products_prior.csv'), index_col = False)

In [5]:
# importing orders_checked data frame
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'prepared Data', 'orders_checked.csv'), index_col = False)

In [6]:
# Check the output
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [7]:
# Check the output
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,time_of_day,days_since_prior_order,First_Order
0,2539329,1,1,2,8,NaN,First Order
1,2398795,1,2,3,7,15.0,Not First Order
2,473747,1,3,3,12,21.0,Not First Order
3,2254736,1,4,4,7,29.0,Not First Order
4,431534,1,5,4,15,28.0,Not First Order

In [8]:
df_ords_prior.shape

(32434489, 4)

In [9]:
#df_ords.shape

In [10]:
# Merging df_ords and df_ords_prior and creating the new dataframe df_merged_large
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', how = 'inner', indicator = True)

In [11]:
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,time_of_day,days_since_prior_order,First_Order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,First Order,196,1,0,both
1,2539329,1,1,2,8,NaN,First Order,14084,2,0,both
2,2539329,1,1,2,8,NaN,First Order,12427,3,0,both
3,2539329,1,1,2,8,NaN,First Order,26088,4,0,both
4,2539329,1,1,2,8,NaN,First Order,26405,5,0,both

In [12]:
df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

In [13]:
df_merged_large.shape

(32434489, 11)

In [14]:
# Exporting data to csv
df_merged_large.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.csv'))

In [15]:
# Exporting data to pkl
df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))